In [1]:
# SHARK ATTACKS DATA CLEANNING

In [2]:
# IMPORT LIBRERY

import numpy as np
import pandas as pd
import SRC.cleaning_functions as fc

# PIP INSTALL

!pip install numpy
!pip install pandas

Requirement already satisfied: numpy in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (1.21.3)
Requirement already satisfied: pandas in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (from pandas) (1.21.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [3]:
# LOADDING DATA

df = pd.read_csv("Data/attacks.csv",encoding = "ISO-8859-1")

In [4]:
# CHECKING HEAD

display(df.head(3))

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN

In [5]:
# CHECKING SHAPE

display(df.shape)

(25723, 24)

In [6]:
# CLEANNING DATAFRAME POST DEFINITION OF HYPOTHESIS

# LIST OF COLUMNS TO DROP

column = ["pdf", 
          "href", 
          "href formula",
          "Unnamed: 22",
          "Unnamed: 23",
          "Type",
          "Date",
          "Name",
          "Sex ",
          "Age",
          "Injury",
          "Area",
          "Investigator or Source",
          "Case Number.1",
          "Case Number.2",
          "original order"]

# DROP 

shark = df.drop(column,axis=1)

In [7]:
# CHECKING Null

display(shark.isnull().sum())

Case Number    17021
Year           19423
Country        19471
Location       19961
Activity       19965
Fatal (Y/N)    19960
Time           22775
Species        22259
dtype: int64

In [8]:
# CHECKING NEW DATAFRAME SHAPE

display(shark.head(3))

,Case Number,Year,Country,Location,Activity,Fatal (Y/N),Time,Species
0,2018.06.25,2018.0,USA,"Oceanside, San Diego County",Paddling,N,18h00,White shark
1,2018.06.18,2018.0,USA,"St. Simon Island, Glynn County",Standing,N,14h00 -15h00,NaN
2,2018.06.09,2018.0,USA,"Habush, Oahu",Surfing,N,07h45,NaN

In [9]:
# CHECKING SHAPE

display(shark.shape)

(25723, 8)

In [10]:
# ERASE ALL THE ROWS WITH NaN >= 4

display(shark.dropna(thresh=4))

,Case Number,Year,Country,Location,Activity,Fatal (Y/N),Time,Species
0,2018.06.25,2018.0,USA,"Oceanside, San Diego County",Paddling,N,18h00,White shark
1,2018.06.18,2018.0,USA,"St. Simon Island, Glynn County",Standing,N,14h00 -15h00,NaN
2,2018.06.09,2018.0,USA,"Habush, Oahu",Surfing,N,07h45,NaN
3,2018.06.08,2018.0,AUSTRALIA,Arrawarra Headland,Surfing,N,NaN,2 m shark
4,2018.06.04,2018.0,MEXICO,La Ticla,Free diving,N,NaN,"Tiger shark, 3m"
...,...,...,...,...,...,...,...,...
6297,ND.0005,0.0,AUSTRALIA,Roebuck Bay,Diving,Y,NaN,NaN
6298,ND.0004,0.0,AUSTRALIA,NaN,Pearl diving,Y,NaN,NaN
6299,ND.0003,0.0,USA,Ocracoke Inlet,Swimming,Y,NaN,NaN
6300,ND.0002,0.0,PANAMA,"Panama Bay 8ºN, 79ºW",NaN,Y,NaN,NaN
6301,ND.0001,0.0,CEYLON (SRI LANKA),"Below the English fort, Trincomalee",Swimming,Y,NaN,NaN

In [11]:
# CHECKING 'Case Number' DUPLICATES, SINCE IS THE ONLY ONE THAT CAN NOT HAVE DUPLICATES.

display(shark['Case Number'].duplicated().sum())

19435

In [12]:
# MAKING A LIST WITH THE "Case Numbers" DUPLICATES TO KNOW THEM.

dup = shark[shark['Case Number'].duplicated(keep='last')]['Case Number'].tolist()

In [13]:
# THE LAST 10 ITEMS OF THE LIST ARE THE ONES THAT WE WANT TO ERASE

print(dup[0:10])

['2014.08.02', '2013.10.05', '2012.09.02.b', '2009.12.18', '2006.09.02', '2005.04.06', '1990.05.10', '1983.06.15', '1980.07.00', '1966.12.26']

In [14]:
# CREATE A SET TO CHECK AGAINST THE DF.SHARK

set_dup = set(dup)

In [15]:
# CREATE A FOR LOOP SO THAT WE CAN ENSURE DUPLICATES HAD THE SAME INFORMATION

for r in set_dup:
        dup = shark[shark['Case Number'] == r]

shark.loc[dup.iloc[1,:].name, 'Case Number'] = shark.loc[dup.iloc[1,:].name]['Case Number'] + 'z'

In [16]:
# THERE SHOULD BE NO DUPLICATES

display(shark.duplicated().sum())

19417

In [65]:
# CHECKING INFO

display(shark.head(3))

,Case Number,Year,Country,Location,Activity,Fatal (Y/N),Time,Species
0,2018.06.25,2018.0,USA,"Oceanside, San Diego County",Paddling,N,18h00,White shark
1,2018.06.18,2018.0,USA,"St. Simon Island, Glynn County",Standing,N,14h00 -15h00,NaN
2,2018.06.09,2018.0,USA,"Habush, Oahu",Surfing,N,07h45,NaN

In [18]:
# CREATING THE FINAL DATAFRAME, ERASING THE ROWS WITH >= 4 NaN

new_shark = shark.dropna(thresh=4)

In [66]:
# CHECKING INFO

display(new_shark.head(3))

,Case Number,Year,Country,Location,Activity,Fatal (Y/N),Time,Species
0,2018.06.25,2018.0,USA,"Oceanside, San Diego County",Paddling,N,18h00,White shark
1,2018.06.18,2018.0,USA,"St. Simon Island, Glynn County",Standing,N,14h00 -15h00,NaN
2,2018.06.09,2018.0,USA,"Habush, Oahu",Surfing,N,07h45,NaN

In [20]:
# ERASE ["Case Number"] SINCE THERE ARE NO MORE DUPLICATES ALSO "LOCATION" AND "YEAR" SINCE I DON´T NEED THEM
# CREATING A NEW DF "SHARKY"

column_2 = ["Case Number","Location","Year"]
sharky = new_shark.drop(column_2,axis=1)

In [67]:
# CHECKING THE NEW DATAFRAME

display(sharky.head(3))

,Country,Activity,Fatal (Y/N),Time,Species,Activity_merged,Species_merged,Time_merged
0,USA,Paddling,N,18h00,White shark,Surfing,White shark,Afternoon
1,USA,Standing,N,14h00 -15h00,UNKNOWN,Unknown,Unknown,Noon
2,USA,Surfing,N,07h45,UNKNOWN,Surfing,Unknown,Sunrise

In [22]:
# FILLING NaN WITH A "Unknown"

sharky = sharky.fillna("UNKNOWN")

In [68]:
# CHECKING THE NEW DATAFRAME WITH UNKNOWN

display(sharky.head(3))

,Country,Activity,Fatal (Y/N),Time,Species,Activity_merged,Species_merged,Time_merged
0,USA,Paddling,N,18h00,White shark,Surfing,White shark,Afternoon
1,USA,Standing,N,14h00 -15h00,UNKNOWN,Unknown,Unknown,Noon
2,USA,Surfing,N,07h45,UNKNOWN,Surfing,Unknown,Sunrise

In [24]:
# MAKING A LIST UNIQUE FOR "COUNTRY"

countries = list(sharky['Country'].unique())

In [25]:
# CHECKING THE AMOUNT PER "COUNTRY"

display(sharky.Country.value_counts())

USA                      2228
AUSTRALIA                1337
SOUTH AFRICA              579
PAPUA NEW GUINEA          134
NEW ZEALAND               128
                         ...
THE BALKANS                 1
NORTH ATLANTIC OCEAN        1
MAYOTTE                     1
GABON                       1
CEYLON (SRI LANKA)          1
Name: Country, Length: 212, dtype: int64

In [69]:
# CHECKING VALUES AND SYNTAX PER "COUNTRY"

# print(countries)

In [27]:
# REDUCE COUNTRIES TO BETTER VISUALIZE THE PLOTS

sharky['Country'].replace({
'MEXICO  ' : 'MEXICO',
'MALDIVE ISLANDS':'MALDIVES',
' ':'DESCONOCIDO ',
'WESTERN SAMOA':'SAMOA',
'AMERICAN SAMOA':'SAMOA',
'SOLOMON ISLANDS / VANUATU':'SOLOMON ISLANDS',
'EGYPT / ISRAEL':'',
'EGYPT  ':'EGYPT ',
'REUNION' : 'REUNION ISLAND',
' PHILIPPINES':'PHILIPPINES',
'SOUTH CHINA SEA':'CHINA',
'Fiji' : 'FIJI',
'ITALY / CROATIA' : 'ITALY',
'NORTH ATLANTIC OCEAN' : 'ATLANTIC OCEAN',
'MID ATLANTIC OCEAN' : 'ATLANTIC OCEAN',
'SOUTH ATLANTIC OCEAN' : 'ATLANTIC OCEAN',
'NORTH ATLANTIC OCEAN ' : 'ATLANTIC OCEAN',
'EGYPT / ISRAEL' : 'ISRAEL',
'DIEGO GARCIA' : 'UNKONOWN',
'Seychelles' : 'SEYCHELLES',
' TONGA' : 'TONGA',
'YEMEN ' : 'YEMEN',
'Sierra Leone' : 'SIERRA LEONE',
'RED SEA / INDIAN OCEAN' : 'INDIA',
'INDIAN OCEAN' : 'INDIA',
'INDIAN OCEAN?' : 'INDIA',
'Between PORTUGAL & INDIA' : 'INDIA',
'FEDERATED STATES OF MICRONESIA' : 'MICRONESIA',
'IRAN / IRAQ' : 'IRAN',
'ANDAMAN / NICOBAR ISLANDAS' : 'ANDAMAN ISLANDS',
    
},inplace=True)

In [70]:
# CHECKING THE AMOUNT PER "COUNTRY" NEW

# display(sharky.Country.value_counts())

In [29]:
# MAKING A LIST UNIQUE FOR "ACTIVITY"

activities = list(sharky['Activity'].unique())

In [71]:
# CHECKING THE AMOUNT PER "ACTIVITY"

# display(sharky.Activity.value_counts())

In [64]:
# CHECKING VALUES AND SYNTAX FOR "ACTIVITY"

# print(activities)

In [32]:
# MAKING A LIST UNIQUE FOR "FATALS"

fatals = list(sharky['Fatal (Y/N)'].unique())

In [72]:
# CHECKING THE AMOUNT PER "FATAL (Y/N)"

# display(sharky['Fatal (Y/N)'].value_counts())

In [34]:
# CHECKING VALUES AND SYNTAX FOR "FATALS"

print(fatals)

['N', 'Y', 'UNKNOWN', 'M', '2017', ' N', 'N ', 'y']

In [35]:
# REDUCE FATLA TO BETTER VISUALIZE THE PLOTS

sharky['Fatal (Y/N)'].replace({' ':'UNKNOWN','M':'UNKNOWN','2017':'UNKNOWN',' N':'N','N ':'N','y':'Y'},inplace=True)

In [36]:
# CHECKING THE AMOUNT PER "FATAL (Y/N)"

display(sharky['Fatal (Y/N)'].value_counts())

N          4298
Y          1388
UNKNOWN     606
Name: Fatal (Y/N), dtype: int64

In [37]:
# MAKING A LIST UNIQUE FOR "TIME"

time = list(sharky['Time'].unique())

In [73]:
# CHECKING THE AMOUNT PER "TIME"

# display(sharky.Time.value_counts())

In [74]:
# CHECKING VALUES AND SYNTAX FOR "TIME"

# print(time)

In [40]:
# MAKING A LIST UNIQUE FOR "SPECIES"

species = list(sharky['Species '].unique())

In [75]:
# CHECKING THE AMOUNT PER "SPECIES"

# display(sharky['Species '].value_counts())

In [76]:
# CHECKING VALUES AND SYNTAX FOR "SPECIES"

# print(species)

In [43]:
# NEED TO APPLY REGEX TO "ACTIVITIES"

sharky['Activity_merged'] = sharky['Activity'].apply(fc.limpia)

In [44]:
display(sharky['Activity_merged'].value_counts())

Unknown     1838
Surfing     1590
Swimming    1304
Fishing     1175
Diving       323
Boating       62
Name: Activity_merged, dtype: int64

In [45]:
# NEED TO APPLY REGEX TO "ACTIVITIES"

sharky['Species_merged'] = sharky['Species '].apply(fc.specie)

In [46]:
display(sharky['Species_merged'].value_counts())

Unknown                4911
White shark             668
Tiger shark             287
Bull shark              178
Whitetip shark          108
Shortfin Mako Shark      59
Hammerhead Shark         48
Sand Tiger Shark         18
Blacktip Shark           15
Name: Species_merged, dtype: int64

In [77]:
display(sharky.head(3))

,Country,Activity,Fatal (Y/N),Time,Species,Activity_merged,Species_merged,Time_merged
0,USA,Paddling,N,18h00,White shark,Surfing,White shark,Afternoon
1,USA,Standing,N,14h00 -15h00,UNKNOWN,Unknown,Unknown,Noon
2,USA,Surfing,N,07h45,UNKNOWN,Surfing,Unknown,Sunrise

In [48]:
# NEED TO APPLY REGEX TO "TIME"

sharky['Time_merged'] = sharky['Time'].apply(fc.hour)

In [78]:
display(sharky.head(3))

,Country,Activity,Fatal (Y/N),Time,Species,Activity_merged,Species_merged,Time_merged
0,USA,Paddling,N,18h00,White shark,Surfing,White shark,Afternoon
1,USA,Standing,N,14h00 -15h00,UNKNOWN,Unknown,Unknown,Noon
2,USA,Surfing,N,07h45,UNKNOWN,Surfing,Unknown,Sunrise

In [50]:
sharky['Time_merged'].replace({
    'UNKNOWN':'Unknown',
    'Early afternoon':'Unknown',
    'Midnight':'Night',
    'After noon':'Afternoon',
    'Midday.': 'Noon',
    'Just before noon':'Noon',
    'Lunchtime':'Noon',
    'Midday':'Noon',
    'Morning ':'Morning',
    'Sometime between 06h00 & 08hoo':'Unknown',
    '9h00':'Morning',
    '"shortly before dusk"':'Unknown',
    'Late afternoon':'Afternoon',
    '2017':'UNKNOWN',
    'Midday':'Noon',
    'Shortly before 12h00':'Noon',
    'Early morning':'Sunrise',
    'Dawn':'Unknown',
    'AM':'Unknown',
    'A.M.':'Unknown',
    'Dusk':'Unknown',
    'Luchtime':'Afternoon',
    'Before 07h00':'Evening',
    '"Just before 11h00"':'Noon',
    'Sunset':'Evening',
    '  ':'Unknown',
    '"Evening"':'Evening',
    'Just before sundown':'Unknown',
    'Between 05h00 and 08h00':'Sunrise',
    '>08h00':'Noon',
    '--':'Unknown',
    'Just after 12h00':'Morning',
    ' ':'Unknown',
    'Early Morning':'Sunrise',
    'Shortly after midnight':'Evening',
    '\xa0 ':'Unknown',
    'Late morning':'Morning',
    'P.M.':'Unknown',
    'Shortly before 13h00':'Noon',
    '8:04 pm':'Morning',
    'Possibly same incident as 2000.08.21':'Unknown',
    'After Dusk':'Unknown',
    '2 hours after Opperman':'Unknown',
    'Mid afternoon':'Afternoon',
    'Mid morning':'Morning',
    '"Night"':'Night',
    '30 minutes after 1992.07.08.a':'Unknown',
    '>06h45':'Sunrise',
    'Between 06h00 & 07h20':'Sunrise',
    '<07h30':'Sunrise',
    'Nightfall':'Night',
    'X':'Unknown',
    'Prior to 10h37':'Unknown',
    'Daybreak':'Unknown',
    '>12h00':'Noon',
    'Mid-morning':'Morning',
    'Just before dawn':'Unknown',
    ' 14h00':'Noon',
    'Daytime':'Unknown',
    'Dark':'Night',
    '"After lunch"':'Afternoon',
    '>17h00':'Afternoon',
    'night':'Night',
    'Late night':'Sunrise',
    'Midday':'Noon',
    '"After dark"':'Night',
    '2 hrs before sunset':'Evening',
    'shortly before dusk':'Unknown',
    '>17h30':'Afternoon',
    '>14h30':'Noon',
    'Between 11h00 & 12h00':'Morning',
    'After 04h00':'Sunrise',
    'Ship aban-doned at 03h10':'Unknown',
    'After dusk':'Unknown',
    'FATAL  (Wire netting installed at local beaches after this incident.)':'Unknown',
    'After midnight':'Night',
    'Late afternon':'Evening',
    '"Early evening"':'Evening',
    'Late Afternoon':'Afternoon',
    '   ':'Unknown',
    'Before daybreak':'Unknown',
    'dusk':'Unknown',
    'Before 10h30':'Morning'
},inplace=True)

In [51]:
display(sharky['Time_merged'].value_counts())

Unknown      3422
Noon          897
Afternoon     852
Morning       781
Sunrise       151
Night          96
Evening        93
Name: Time_merged, dtype: int64

In [52]:
hour = list(sharky['Time_merged'].unique())

In [54]:
# EVERYTHING MERGE INTO CATEGORIES

print(hour)

['Afternoon', 'Noon', 'Sunrise', 'Unknown', 'Morning', 'Evening', 'Night']

In [55]:
act = list(sharky['Activity_merged'].unique())

In [56]:
# EVERYTHING MERGE INTO CATEGORIES

print(act)

['Surfing', 'Unknown', 'Diving', 'Swimming', 'Fishing', 'Boating']

In [57]:
coun = list(sharky['Country'].unique())

In [79]:
# EVERYTHING MERGE INTO CATEGORIES

# print(coun)

In [59]:
sharky.to_csv('data/shark_attack_clean.csv')

In [80]:
display(sharky.head(3))

,Country,Activity,Fatal (Y/N),Time,Species,Activity_merged,Species_merged,Time_merged
0,USA,Paddling,N,18h00,White shark,Surfing,White shark,Afternoon
1,USA,Standing,N,14h00 -15h00,UNKNOWN,Unknown,Unknown,Noon
2,USA,Surfing,N,07h45,UNKNOWN,Surfing,Unknown,Sunrise